# Создать вектор размера 10 со значениями от 0 до 1, не включая ни то, ни другое
import numpy as np

a = np.random.random((10,1))
print(a)